renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/user_application/ota/type2/src/smc_gen/r_memdrv_rx/src/r_memdrv_rspi.c
    if (r_memdrv_dtc_enable(&dtc_info) != MEMDRV_SUCCESS)
    {
        return MEMDRV_ERR_OTHER;
    }

    dtc_info.drv            = MEMDRV_DRVR_RX_FIT_RSPI;
    dtc_info.src_adr        = reg_adr;
    dtc_info.dst_adr        = (uint32_t)p_memdrv_info->p_data;
    dtc_info.block_size     = 0;
    dtc_info.cnt            = p_memdrv_info->cnt;
    dtc_info.p_dtc_cfg      = &dtc_cfg;
    dtc_info.p_dtc_transfer = &g_memdrv_dtc_info[devno][MEMDRV_INDEX_DTC_RX];
    switch (channel)
    {
        case 0:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0)
            dtc_info.act_source = DTCE_RSPI0_SPRI0;
    #endif
        }
        break;
        case 1:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1)
            dtc_info.act_source = DTCE_RSPI1_SPRI1;
    #endif
        }
        break;
        case 2:
        {
    #if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2) | \
        ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2)
            dtc_info.act_source = DTCE_RSPI2_SPRI2;
    #endif
        }
        break;
        default:
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return MEMDRV_ERR_OTHER;
        }
        break;
    }

    r_memdrv_dtc_set_rx(&dtc_info);

    if (r_memdrv_dtc_enable(&dtc_info) != MEMDRV_SUCCESS)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#endif  /* (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC) */

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_enable_rx_data_dtc() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_tx
* Description  : Transmits data for command and status register.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_HARD                        ;   Hardware error
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_rspi_tx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    uint8_t             channel = r_memdrv_get_drv_ch(devno);
    memdrv_err_t        ret_memdrv = MEMDRV_SUCCESS;
    rspi_command_word_t spcmd_cmd_word;

#if ((MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)   | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC))
    rspi_cmd_trans_mode_t   mode;
    rspi_err_t   ret_drv = RSPI_SUCCESS;
#endif

#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif

#if ((MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)   | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC))
    mode.transfer_mode = RSPI_TRANS_MODE_SW;
    ret_drv = R_RSPI_Control(g_rspi_handle,
                             RSPI_CMD_SET_TRANS_MODE,
                             (void *)&mode);
    if (RSPI_SUCCESS != ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#endif
    ret_memdrv = r_memdrv_rspi_write_data(channel, p_memdrv_info->cnt, p_memdrv_info->p_data, spcmd_cmd_word);
    if (MEMDRV_SUCCESS != ret_memdrv)
    {
        return MEMDRV_ERR_OTHER;
    }
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_tx() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_tx_data
* Description  : Transmits data using the single mode.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_HARD                        ;   Hardware error
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
#if (MEMDRV_CFG_DEV0_TYPE == 1)  | (MEMDRV_CFG_DEV1_TYPE == 1)
memdrv_err_t r_memdrv_rspi_tx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    uint8_t                 channel = r_memdrv_get_drv_ch(devno);
    rspi_command_word_t     spcmd_cmd_word;
    rspi_err_t              ret_drv = RSPI_SUCCESS;
    memdrv_err_t            ret_memdrv = MEMDRV_SUCCESS;
    rspi_cmd_trans_mode_t   mode;

#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_DATA_CMD;
#else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_DATA_CMD;
#endif

    /* Set transfer mode. */
    if (MEMDRV_ADDR_BOUNDARY & (uint32_t)p_memdrv_info->p_data)
    {
        /* If the buffer address is not 4 bytes alignment, force to perform the CPU transfer. */
        mode.transfer_mode = RSPI_TRANS_MODE_SW;
#if RSPI_LITTLE_ENDIAN == 1
        spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
        spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif
    }
    else if (MEMDRV_CHK_MULT_OF_4 & p_memdrv_info->cnt)
    {
        /* If the data counter is not multiple of 4, force to perform the CPU transfer. */
        mode.transfer_mode = RSPI_TRANS_MODE_SW;
#if RSPI_LITTLE_ENDIAN == 1
        spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
        spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif
    }
    else
    {
        mode.transfer_mode = r_memdrv_rspi_set_tran_mode(devno);
    }
    ret_drv = R_RSPI_Control(g_rspi_handle,
                             RSPI_CMD_SET_TRANS_MODE,
                             (void *)&mode);
    if (RSPI_SUCCESS != ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
    r_rspi_exchg(p_memdrv_info->p_data, p_memdrv_info->cnt);
    ret_memdrv = r_memdrv_rspi_write_data(channel, p_memdrv_info->cnt, p_memdrv_info->p_data, spcmd_cmd_word);
    if (MEMDRV_SUCCESS != ret_memdrv)
    {
        r_rspi_exchg(p_memdrv_info->p_data, p_memdrv_info->cnt);
        return MEMDRV_ERR_OTHER;
    }
    r_rspi_exchg(p_memdrv_info->p_data, p_memdrv_info->cnt);
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_tx_data() */
#elif(MEMDRV_CFG_DEV0_TYPE == 0)  | (MEMDRV_CFG_DEV1_TYPE == 0)
memdrv_err_t r_memdrv_rspi_tx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    uint8_t                 channel = r_memdrv_get_drv_ch(devno);
    rspi_command_word_t     spcmd_cmd_word;
    rspi_err_t              ret_drv = RSPI_SUCCESS;
    memdrv_err_t            ret_memdrv = MEMDRV_SUCCESS;
    rspi_cmd_trans_mode_t   mode;

