renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/user_application/ota/type2/src/smc_gen/r_memdrv_rx/src/r_memdrv_rspi.c
    uint32_t                bound_cnt = 0;
    uint8_t *               pdsrc = p_memdrv_info->p_data;
    uint16_t                txcnt = p_memdrv_info->cnt;


    if (0 != ((uint32_t)(p_memdrv_info->p_data) & MEMDRV_ADDR_BOUNDARY))
    {
        bound_cnt = (0x00000004 - ((uint32_t)(p_memdrv_info->p_data) & MEMDRV_ADDR_BOUNDARY));
        txcnt = bound_cnt;
        mode.transfer_mode = RSPI_TRANS_MODE_SW;
#if RSPI_LITTLE_ENDIAN == 1
        spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
        spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }

        ret_memdrv = r_memdrv_rspi_write_data(channel, txcnt, pdsrc, spcmd_cmd_word);
        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            return MEMDRV_ERR_OTHER;
        }
        pdsrc = (uint8_t *)(p_memdrv_info->p_data + bound_cnt);
        txcnt = p_memdrv_info->cnt - bound_cnt;
    }
    if (0 != (txcnt & (uint16_t) 0xfffffffc))
    {
        txcnt = (txcnt & (uint16_t) 0xfffffffc);
        mode.transfer_mode = r_memdrv_rspi_set_tran_mode(devno);

#if RSPI_LITTLE_ENDIAN == 1
        spcmd_cmd_word.word[0] = MEMDRV_TRNS_DATA_CMD;
#else
        spcmd_cmd_word.word[1] = MEMDRV_TRNS_DATA_CMD;
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }
        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_enable_tx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_enable_tx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_enable_tx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_enable_tx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        r_rspi_exchg(pdsrc, txcnt);
        ret_memdrv = r_memdrv_rspi_write_data(channel, txcnt, pdsrc, spcmd_cmd_word);
        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            r_rspi_exchg(pdsrc, txcnt);
            return MEMDRV_ERR_OTHER;
        }
        r_rspi_exchg(pdsrc, txcnt);
        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_tx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_tx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_tx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_tx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        pdsrc = (uint8_t *)(pdsrc + txcnt);
    }
    if (0 != ((uint32_t)(p_memdrv_info->cnt - bound_cnt) & MEMDRV_CHK_MULT_OF_4))
    {
        txcnt = (uint32_t)((p_memdrv_info->cnt - bound_cnt) & MEMDRV_CHK_MULT_OF_4);
        mode.transfer_mode = RSPI_TRANS_MODE_SW;

#if RSPI_LITTLE_ENDIAN == 1
        spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
        spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }


        ret_memdrv = r_memdrv_rspi_write_data(channel, txcnt, pdsrc, spcmd_cmd_word);
        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            return MEMDRV_ERR_OTHER;
        }
    }

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_tx_data() */
#endif
/************************************************************************************************
* Function Name: r_memdrv_rspi_rx
* Description  : Receives data for status register and Read ID.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_HARD                        ;   Hardware error
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_rspi_rx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    uint8_t                 channel = r_memdrv_get_drv_ch(devno);
    memdrv_err_t            ret_memdrv = MEMDRV_SUCCESS;
    rspi_command_word_t     spcmd_cmd_word;

