renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/user_application/ota/type2/src/smc_gen/r_memdrv_rx/src/r_memdrv_rspi.c
#if ((MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)   | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC))
    rspi_cmd_trans_mode_t   mode;
    rspi_err_t              ret_drv = RSPI_SUCCESS;
#endif

#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif

#if ((MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)  | \
    (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)   | \
    (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC))
    mode.transfer_mode = RSPI_TRANS_MODE_SW;
    ret_drv = R_RSPI_Control(g_rspi_handle,
                             RSPI_CMD_SET_TRANS_MODE,
                             (void *)&mode);
    if (RSPI_SUCCESS != ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
#endif

    ret_memdrv = r_memdrv_rspi_read_data(channel, p_memdrv_info->cnt, p_memdrv_info->p_data, spcmd_cmd_word);
    if (MEMDRV_SUCCESS != ret_memdrv)
    {
        return MEMDRV_ERR_OTHER;
    }
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_rx() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_rx_data
* Description  : Receives data using the single mode.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                       ;   Successful operation
*              : MEMDRV_ERR_HARD                      ;   Hardware error
*              : MEMDRV_ERR_OTHER                     ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
#if (MEMDRV_CFG_DEV0_TYPE ==1)  | (MEMDRV_CFG_DEV1_TYPE ==1)
memdrv_err_t r_memdrv_rspi_rx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    rspi_command_word_t     spcmd_cmd_word;
    rspi_err_t     ret_drv = RSPI_SUCCESS;
    memdrv_err_t            ret_memdrv = MEMDRV_SUCCESS;
    rspi_cmd_trans_mode_t   mode;

#if RSPI_LITTLE_ENDIAN == 1
    spcmd_cmd_word.word[0] = MEMDRV_TRNS_DATA_CMD;
#else
    spcmd_cmd_word.word[1] = MEMDRV_TRNS_DATA_CMD;
#endif

    /* Set transfer mode. */
    if (MEMDRV_ADDR_BOUNDARY & (uint32_t)p_memdrv_info->p_data)
    {
        /* If the buffer address is not 4 bytes alignment, force to perform the CPU transfer. */
        mode.transfer_mode = RSPI_TRANS_MODE_SW;
#if RSPI_LITTLE_ENDIAN == 1
        spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
        spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif
    }
    else if (MEMDRV_CHK_MULT_OF_4 & p_memdrv_info->cnt)
    {
        /* If the data counter is not multiple of 4, force to perform the CPU transfer. */
        mode.transfer_mode = RSPI_TRANS_MODE_SW;
#if RSPI_LITTLE_ENDIAN == 1
        spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
        spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif
    }
    else
    {
        mode.transfer_mode = r_memdrv_rspi_set_tran_mode(devno);
    }
    ret_drv = R_RSPI_Control(g_rspi_handle,
                             RSPI_CMD_SET_TRANS_MODE,
                             (void *)&mode);
    if (RSPI_SUCCESS != ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
    
    r_rspi_exchg(p_memdrv_info->p_data, p_memdrv_info->cnt);
    ret_memdrv = r_memdrv_rspi_read_data(channel, p_memdrv_info->cnt, p_memdrv_info->p_data, spcmd_cmd_word);
    if (MEMDRV_SUCCESS != ret_memdrv)
    {
        r_rspi_exchg(p_memdrv_info->p_data, p_memdrv_info->cnt);
        return MEMDRV_ERR_OTHER;
    }
    r_rspi_exchg(p_memdrv_info->p_data, p_memdrv_info->cnt);

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_rx_data() */
#elif (MEMDRV_CFG_DEV0_TYPE ==0)  | (MEMDRV_CFG_DEV1_TYPE ==0)
memdrv_err_t r_memdrv_rspi_rx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    rspi_command_word_t     spcmd_cmd_word;
    rspi_err_t     ret_drv = RSPI_SUCCESS;
    memdrv_err_t   ret_memdrv = MEMDRV_SUCCESS;
    rspi_cmd_trans_mode_t   mode;

    uint32_t                bound_cnt = 0;
    uint8_t *               pdest = p_memdrv_info->p_data;
    uint16_t                rxcnt = p_memdrv_info->cnt;

    if (0 != ((uint32_t)(p_memdrv_info->p_data) & MEMDRV_ADDR_BOUNDARY))
    {
        bound_cnt = (0x00000004 - ((uint32_t)(p_memdrv_info->p_data) & MEMDRV_ADDR_BOUNDARY));
        rxcnt = bound_cnt;
        mode.transfer_mode = RSPI_TRANS_MODE_SW;
#if RSPI_LITTLE_ENDIAN == 1
        spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
        spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }

        ret_memdrv = r_memdrv_rspi_read_data(channel, rxcnt, pdest, spcmd_cmd_word);
        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            return MEMDRV_ERR_OTHER;
        }

        pdest = (uint8_t *)(p_memdrv_info->p_data + bound_cnt);
        rxcnt = p_memdrv_info->cnt - bound_cnt;
    }
    if (0 != (rxcnt & (uint16_t) 0xfffffffc))
    {
        rxcnt = (rxcnt & (uint16_t) 0xfffffffc);
        mode.transfer_mode = r_memdrv_rspi_set_tran_mode(devno);

#if RSPI_LITTLE_ENDIAN == 1
        spcmd_cmd_word.word[0] = MEMDRV_TRNS_DATA_CMD;
#else
        spcmd_cmd_word.word[1] = MEMDRV_TRNS_DATA_CMD;
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }
        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_enable_rx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_enable_rx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_enable_rx_data_dmac(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_enable_rx_data_dtc(devno,
                                                     p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        r_rspi_exchg(pdest, rxcnt);
        ret_memdrv = r_memdrv_rspi_read_data(channel, rxcnt, pdest, spcmd_cmd_word);
        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            r_rspi_exchg(pdest, rxcnt);
            return MEMDRV_ERR_OTHER;
        }
        r_rspi_exchg(pdest, rxcnt);

