renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/user_application/ota/type2/src/smc_gen/r_memdrv_rx/src/r_memdrv_rspi.c
        if (MEMDRV_DEV0 == devno)
        {
            if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_rx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_rx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        else
        {
            if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
            {
                if (r_memdrv_rspi_disable_rx_data_dmac(devno,
                                                       p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
            {
                if (r_memdrv_rspi_disable_rx_data_dtc(devno,
                                                      p_memdrv_info) != MEMDRV_SUCCESS)
                {
                    return MEMDRV_ERR_OTHER;
                }
            }
            else
            {
                /* CPU transfer */
                R_BSP_NOP();
            }
        }
        pdest = (uint8_t *)(pdest + rxcnt);
    }
    if (0 != ((uint32_t)(p_memdrv_info->cnt - bound_cnt) & MEMDRV_CHK_MULT_OF_4))
    {
        rxcnt = ((uint32_t)(p_memdrv_info->cnt - bound_cnt) & MEMDRV_CHK_MULT_OF_4);
        mode.transfer_mode = RSPI_TRANS_MODE_SW;

#if RSPI_LITTLE_ENDIAN == 1
        spcmd_cmd_word.word[0] = MEMDRV_TRNS_CMD;
#else
        spcmd_cmd_word.word[1] = MEMDRV_TRNS_CMD;
#endif
        ret_drv = R_RSPI_Control(g_rspi_handle,
                                 RSPI_CMD_SET_TRANS_MODE,
                                 (void *)&mode);
        if (RSPI_SUCCESS != ret_drv)
        {
            return MEMDRV_ERR_OTHER;
        }

        ret_memdrv = r_memdrv_rspi_read_data(channel, rxcnt, pdest, spcmd_cmd_word);
        if (MEMDRV_SUCCESS != ret_memdrv)
        {
            return MEMDRV_ERR_OTHER;
        }
    }

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_rx_data() */
#endif
/*******************************************************************************
* Function Name: r_memdrv_rspi_1ms_interval
* Description  : 1ms Interval Timer call function.
* Arguments    : none
* Return Value : none
*******************************************************************************/
void r_memdrv_rspi_1ms_interval(void)
{
    uint8_t channel = 0;
    /* WAIT_LOOP */
    for (channel = 0; channel < RSPI_MAX_CHANNELS; channel++)
    {
        if (gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_FLG] != 0)
        {
            gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_COUNT]++;
        }
    }
} /* End of function r_memdrv_rspi_1ms_interval() */

/************************************************************************************************
* Function Name: r_memdrv_rspi_set_tran_mode
* Description  : Sets transfer mode.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
* Return Value : RSPI_TRANS_MODE_SW
*              : RSPI_TRANS_MODE_DMAC
*              : RSPI_TRANS_MODE_DTC
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static rspi_str_tranmode_t r_memdrv_rspi_set_tran_mode(uint8_t devno)
{
    rspi_str_tranmode_t mode = RSPI_TRANS_MODE_SW;

#if (MEMDRV_CFG_DEV0_INCLUDED == 1)
    if (MEMDRV_DEV0 == devno)
    {
        if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DMAC)
        {
            mode = RSPI_TRANS_MODE_DMAC;
        }
        else if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)
        {
            mode = RSPI_TRANS_MODE_DTC;
        }
        else
        {
            mode = RSPI_TRANS_MODE_SW;
        }
    }
#endif /* (MEMDRV_CFG_DEV0_INCLUDED == 1) */
#if (MEMDRV_CFG_DEV1_INCLUDED == 1)
    if (MEMDRV_DEV1 == devno)
    {
        if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DMAC)
        {
            mode = RSPI_TRANS_MODE_DMAC;
        }
        else if (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
        {
            mode = RSPI_TRANS_MODE_DTC;
        }
        else
        {
            mode = RSPI_TRANS_MODE_SW;
        }
    }
#endif /* (MEMDRV_CFG_DEV1_INCLUDED == 1) */

    return mode;
} /* End of function r_memdrv_rspi_set_tran_mode() */
    
/*******************************************************************************
* Function Name: r_memdrv_rspi_start_timer
* Description  : Sets timer for checking timeout and start timer.
* Arguments    : channel -
*                    Which channel to use
*              : msec -
*                    timeout(msec order)
* Return Value : none
*******************************************************************************/
static void r_memdrv_rspi_start_timer(uint8_t channel, uint32_t msec)
{
    gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_FLG] = 1;
    gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_COUNT] = 0;
    gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_MAX_COUNT] = (uint32_t)(msec);
} /* End of function r_memdrv_rspi_start_timer() */

/*******************************************************************************
* Function Name: r_memdrv_rspi_check_timer
* Description  : Checks timeout to set r_memdrv_rspi_start_timer function.
*              : If timeout,return MEMDRV_ERR_HARD. 
*              : In the case of others, return MEMDRV_SUCCESS.
* Arguments    : channel -
*                    Which channel to use
* Return Value : MEMDRV_SUCCESS -
*                    Successful operation
*                MEMDRV_ERR_HARD -
*                    Hardware error
*******************************************************************************/
static memdrv_err_t r_memdrv_rspi_check_timer(uint8_t channel)
{
    memdrv_err_t ret_drv = MEMDRV_SUCCESS;
    uint32_t gs_memdrv_rspi_timer_cnt_out1 = gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_COUNT];
    uint32_t gs_memdrv_rspi_timer_cnt_out2 = gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_MAX_COUNT];

