renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/user_application/ota/type2/src/smc_gen/r_memdrv_rx/src/r_memdrv_rspi.c
    /* ---- Check compare ---- */
    if (gs_memdrv_rspi_timer_cnt_out1 >= gs_memdrv_rspi_timer_cnt_out2)
    {
        ret_drv = MEMDRV_ERR_HARD;
    }
    else
    {
        ret_drv = MEMDRV_SUCCESS;
    }

    return ret_drv;
} /* End of function r_memdrv_rspi_check_timer() */

/*******************************************************************************
* Function Name: r_memdrv_rspi_end_timer
* Description  : Stops timer to set r_memdrv_rspi_start_timer function.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
static void r_memdrv_rspi_end_timer(uint8_t channel)
{
    gs_memdrv_rspi_timer_cnt_out[channel][RSPI_TIMER_CH_FLG] = 0;
} /* End of function r_memdrv_rspi_end_timer() */

/*******************************************************************************
* Function Name: r_memdrv_rspi_wait
* Description  : Waits for reception completion.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data
* Return Value : MEMDRV_SUCCESS -
*                    Successful operation
*                MEMDRV_ERR_HARD -
*                    Hardware error
*******************************************************************************/
static memdrv_err_t r_memdrv_rspi_wait(uint8_t channel, uint32_t size)
{
    memdrv_err_t    ret_drv  = MEMDRV_SUCCESS;
    uint32_t               time = RSPI_TIMER_MIN_TIME;     // 100ms        

    /* ---- Check DMAC/DTC transfer end.  --- */
    /* Timeout value depends on transfer size. 
       Minimum time is 100ms. When the data count exceeds 10 sectors (1 sector = 512 bytes),
       increase 10ms time for 1 sector increase.*/
    if ((RSPI_SECTOR_SIZE * 10) < size)
    {
        time = (time + (((size / RSPI_SECTOR_SIZE) - 10) * 10));
        if (0x0fffffff < time)
        {
            time = 0x0fffffff;
        }
    }

    /* Start timer. */
    r_memdrv_rspi_start_timer(channel, time);
    /* WAIT_LOOP */
    while (1)
    {
        /* Check timeout. */
        if (MEMDRV_ERR_HARD == r_memdrv_rspi_check_timer(channel))
        {
            ret_drv = MEMDRV_ERR_HARD;
            break;
        }
        if (false == g_transfer_busy)
        {
            break;
        }
    }

    r_memdrv_rspi_end_timer(channel);

    return ret_drv;
}  /* End of function r_memdrv_rspi_wait() */

/*****************************************************************************
* Function Name: r_memdrv_rspi_callback
* Description  : This is an example of an RSPI callback function.
* Arguments    : p_data - pointer to RSPI event code data.
* Return Value : None
******************************************************************************/
static void r_memdrv_rspi_callback(void *p_data)
{
    callback_event = (*(rspi_callback_data_t *)p_data).event_code;
    g_transfer_busy = false;

#if (MEMDRV_CFG_DEV0_MODE_TRNS & MEMDRV_TRNS_DTC)  | (MEMDRV_CFG_DEV1_MODE_TRNS & MEMDRV_TRNS_DTC)
    R_RSPI_IntSpriIerClear(g_rspi_handle);
    R_RSPI_IntSptiIerClear(g_rspi_handle);
    if (0 == g_rspi_handle->channel)
    {
        RSPI0.SPCR.BIT.SPE   = 0;  // Disable RSPI.
#if RSPI_CFG_REQUIRE_LOCK == 1
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0));
#endif
    }
#if RSPI_MAX_CHANNELS >= 2
    else if (1 == g_rspi_handle->channel)
    {
        RSPI1.SPCR.BIT.SPE   = 0;  // Disable RSPI.
#if RSPI_CFG_REQUIRE_LOCK == 1
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI1));
#endif
    }
#endif
#if RSPI_MAX_CHANNELS ==3
    else if (2 == g_rspi_handle->channel)
    {
        RSPI2.SPCR.BIT.SPE   = 0;  // Disable RSPI.
#if RSPI_CFG_REQUIRE_LOCK == 1
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI2));
#endif
    }
#endif
    else
    {
    }
#endif
} /* End of function r_memdrv_rspi_callback() */

/*****************************************************************************
* Function Name: rspi_init_ports
* Description  : This function initializes the port pins associated with
*                RSPI channel 0 using the macros defined in iodefine.h.
* Arguments    : None
* Return Value : None
******************************************************************************/
static void rspi_init_ports(void)
{
#if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH0) || \
    (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH0))
    R_RSPI_PinSet_RSPI0();
#elif ((MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH1) || \
      (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH1))
    R_RSPI_PinSet_RSPI1();
#elif ((MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH2) || \
      (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH2))
    R_RSPI_PinSet_RSPI2();
#else
#error "ERROR - RSPI do not have this channel."
#endif
} /* End of function rspi_init_ports() */

/*****************************************************************************
* Function Name: r_memdrv_rspi_write_data
* Description  : This function initializes the port pins associated with
*                RSPI channel 0 using the macros defined in iodefine.h.
* Arguments    : None
* Return Value : None
******************************************************************************/
static memdrv_err_t r_memdrv_rspi_write_data(uint8_t channel,
                                             uint8_t count,
                                             uint8_t * pdata,
                                             rspi_command_word_t cmd)
{
    rspi_err_t     ret_drv = RSPI_SUCCESS;

    volatile uint32_t debug = 0;


    g_transfer_busy = true;
    ret_drv = R_RSPI_Write(g_rspi_handle,
                           cmd,
                           pdata,
                           count);
    if   (RSPI_SUCCESS != ret_drv)
    {
    	debug = 0x01;
        return MEMDRV_ERR_OTHER;
    }

    /* Wait for transmission completion. */
    if(0 > r_memdrv_rspi_wait(channel, count))
    {
        /* ---- Disable RSPI transmission. ---- */
        R_RSPI_IntSptiDmacdtcFlagSet(g_rspi_handle, RSPI_SET_TRANS_STOP);
        R_RSPI_IntSptiIerClear(g_rspi_handle);
        R_RSPI_IntSpriIerClear(g_rspi_handle);
        g_rspi_handle->channel = channel;
        if (RSPI_SUCCESS != R_RSPI_Close(g_rspi_handle))
        {
        	debug = 0x02;
            return MEMDRV_ERR_OTHER;
        }
        return MEMDRV_ERR_OTHER;
    }

    if (RSPI_EVT_TRANSFER_COMPLETE != callback_event)
    {
    	debug = 0x03;
        return MEMDRV_ERR_OTHER;
    }
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_write_data() */

/*****************************************************************************
* Function Name: r_memdrv_rspi_read_data
* Description  : This function initializes the port pins associated with
*                RSPI channel 0 using the macros defined in iodefine.h.
* Arguments    : None
* Return Value : None
******************************************************************************/
static memdrv_err_t r_memdrv_rspi_read_data(uint8_t channel,
                                            uint8_t count,
                                            uint8_t * pdata,
                                            rspi_command_word_t cmd)
{
    rspi_err_t     ret_drv = RSPI_SUCCESS;

    g_transfer_busy = true;
    ret_drv = R_RSPI_Read(g_rspi_handle,
                           cmd,
                           pdata,
                           count);
    if   (RSPI_SUCCESS != ret_drv)
    {
        return MEMDRV_ERR_OTHER;
    }

    /* Wait for transmission completion. */
    if(0 > r_memdrv_rspi_wait(channel, count))
    {
        /* ---- Disable RSPI transmission. ---- */
        R_RSPI_IntSptiDmacdtcFlagSet(g_rspi_handle, RSPI_SET_TRANS_STOP);
        R_RSPI_IntSptiIerClear(g_rspi_handle);
        R_RSPI_IntSpriIerClear(g_rspi_handle);
        g_rspi_handle->channel = channel;
        if (RSPI_SUCCESS != R_RSPI_Close(g_rspi_handle))
        {
            return MEMDRV_ERR_OTHER;
        }
        return MEMDRV_ERR_OTHER;
    }

    if (RSPI_EVT_TRANSFER_COMPLETE != callback_event)
    {
        return MEMDRV_ERR_OTHER;
    }
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_rspi_read_data() */

